# Join syntax in pandas and SQL (psychoPG)
adapted from http://www.postgresqltutorial.com/

In [1]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [2]:
import pandas as pd

In [3]:
import psycopg2

In [4]:
conn = psycopg2.connect("dbname=dvdrental user=jameshelfrich")

In [5]:
cur = conn.cursor()

In [6]:
cur.execute("SELECT * FROM actor;")

### Demo: create dataframe from psql table

In [7]:
actor_table = cur.fetchall()

In [8]:
actor_df = pd.DataFrame(actor_table)

In [9]:
actor_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
0    200 non-null int64
1    200 non-null object
2    200 non-null object
3    200 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 6.3+ KB

In [10]:
cur.execute("SELECT column_name FROM information_schema.columns WHERE table_name='actor';")
actor_columns = [name[0] for name in cur.fetchall()]

In [11]:
actor_columns

['actor_id', 'first_name', 'last_name', 'last_update']

In [12]:
actor_df.columns = actor_columns

In [13]:
actor_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
actor_id       200 non-null int64
first_name     200 non-null object
last_name      200 non-null object
last_update    200 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 6.3+ KB

In [14]:
#Create customer df
cur.execute("SELECT * FROM customer;")

customer_table = cur.fetchall()

customer_df = pd.DataFrame(customer_table)

In [15]:
customer_df.head()

,0,1,2,3,4,5,6,7,8,9
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1
1,1,1,Mary,Smith,mary.smith@sakilacustomer.org,5,True,2006-02-14,2013-05-26 14:49:45.738,1
2,2,1,Patricia,Johnson,patricia.johnson@sakilacustomer.org,6,True,2006-02-14,2013-05-26 14:49:45.738,1
3,3,1,Linda,Williams,linda.williams@sakilacustomer.org,7,True,2006-02-14,2013-05-26 14:49:45.738,1
4,4,2,Barbara,Jones,barbara.jones@sakilacustomer.org,8,True,2006-02-14,2013-05-26 14:49:45.738,1

In [16]:
cur.execute("SELECT column_name FROM information_schema.columns WHERE table_name='customer';")
customer_cols = [col[0] for col in cur.fetchall()]

customer_cols

['customer_id',
 'store_id',
 'first_name',
 'last_name',
 'email',
 'address_id',
 'activebool',
 'create_date',
 'last_update',
 'active']

In [17]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 10 columns):
0    599 non-null int64
1    599 non-null int64
2    599 non-null object
3    599 non-null object
4    599 non-null object
5    599 non-null int64
6    599 non-null bool
7    599 non-null object
8    599 non-null datetime64[ns]
9    599 non-null int64
dtypes: bool(1), datetime64[ns](1), int64(4), object(4)
memory usage: 42.8+ KB

In [18]:
customer_df.columns = customer_cols

In [19]:
customer_df.head()

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1
1,1,1,Mary,Smith,mary.smith@sakilacustomer.org,5,True,2006-02-14,2013-05-26 14:49:45.738,1
2,2,1,Patricia,Johnson,patricia.johnson@sakilacustomer.org,6,True,2006-02-14,2013-05-26 14:49:45.738,1
3,3,1,Linda,Williams,linda.williams@sakilacustomer.org,7,True,2006-02-14,2013-05-26 14:49:45.738,1
4,4,2,Barbara,Jones,barbara.jones@sakilacustomer.org,8,True,2006-02-14,2013-05-26 14:49:45.738,1

In [20]:
customer_df.set_index("customer_id", inplace=True)

In [21]:
customer_df.sort_index().head()

,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
customer_id,,,,,,,,,
1,1,Mary,Smith,mary.smith@sakilacustomer.org,5,True,2006-02-14,2013-05-26 14:49:45.738,1
2,1,Patricia,Johnson,patricia.johnson@sakilacustomer.org,6,True,2006-02-14,2013-05-26 14:49:45.738,1
3,1,Linda,Williams,linda.williams@sakilacustomer.org,7,True,2006-02-14,2013-05-26 14:49:45.738,1
4,2,Barbara,Jones,barbara.jones@sakilacustomer.org,8,True,2006-02-14,2013-05-26 14:49:45.738,1
5,1,Elizabeth,Brown,elizabeth.brown@sakilacustomer.org,9,True,2006-02-14,2013-05-26 14:49:45.738,1

In [22]:
#Create payment df
cur.execute("SELECT * FROM payment;")

payment_table = cur.fetchall()

payment_df = pd.DataFrame(payment_table)

In [23]:
cur.execute("SELECT column_name FROM information_schema.columns WHERE table_name='payment';")
payment_cols = [col[0] for col in cur.fetchall()]
payment_cols
payment_df.columns = payment_cols

In [24]:
payment_df.head()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,17503,341,2,1520,7.99,2007-02-15 22:25:46.996577
1,17504,341,1,1778,1.99,2007-02-16 17:23:14.996577
2,17505,341,1,1849,7.99,2007-02-16 22:41:45.996577
3,17506,341,2,2829,2.99,2007-02-19 19:39:56.996577
4,17507,341,2,3130,7.99,2007-02-20 17:31:48.996577

In [25]:
payment_df.set_index("payment_id", inplace=True)

In [26]:
payment_df.sort_index(inplace=True)

In [27]:
payment_df.head()

            customer_id  staff_id  rental_id amount               payment_date
payment_id
17503               341         2       1520   7.99 2007-02-15 22:25:46.996577
17504               341         1       1778   1.99 2007-02-16 17:23:14.996577
17505               341         1       1849   7.99 2007-02-16 22:41:45.996577
17506               341         2       2829   2.99 2007-02-19 19:39:56.996577
17507               341         2       3130   7.99 2007-02-20 17:31:48.996577

## Inner Join

### With PsychoPG

In [28]:
cur.execute(
'''
SELECT
    customer.customer_id,
    first_name,
    last_name,
    email,
    amount,
    payment_date
FROM
    customer
INNER JOIN payment
    ON payment.customer_id = customer.customer_id
'''
)

In [29]:
inner_join_query = pd.DataFrame(cur.fetchall())

In [30]:
inner_join_query.head()

,0,1,2,3,4,5
0,341,Peter,Menard,peter.menard@sakilacustomer.org,7.99,2007-02-15 22:25:46.996577
1,341,Peter,Menard,peter.menard@sakilacustomer.org,1.99,2007-02-16 17:23:14.996577
2,341,Peter,Menard,peter.menard@sakilacustomer.org,7.99,2007-02-16 22:41:45.996577
3,341,Peter,Menard,peter.menard@sakilacustomer.org,2.99,2007-02-19 19:39:56.996577
4,341,Peter,Menard,peter.menard@sakilacustomer.org,7.99,2007-02-20 17:31:48.996577

In [31]:
inner_join_query.shape

(14596, 6)

### With pandas

In [32]:
pandas_inner_join = payment_df.join(customer_df, on="customer_id")\
[["customer_id", "first_name", "last_name", "email", "amount", "payment_date"]]

In [33]:
pandas_inner_join.head()

,customer_id,first_name,last_name,email,amount,payment_date
payment_id,,,,,,
17503,341,Peter,Menard,peter.menard@sakilacustomer.org,7.99,2007-02-15 22:25:46.996577
17504,341,Peter,Menard,peter.menard@sakilacustomer.org,1.99,2007-02-16 17:23:14.996577
17505,341,Peter,Menard,peter.menard@sakilacustomer.org,7.99,2007-02-16 22:41:45.996577
17506,341,Peter,Menard,peter.menard@sakilacustomer.org,2.99,2007-02-19 19:39:56.996577
17507,341,Peter,Menard,peter.menard@sakilacustomer.org,7.99,2007-02-20 17:31:48.996577

In [34]:
pandas_inner_join.shape

(14596, 6)

## Left Join

### With psychopg

In [35]:
cur.execute(
'''
SELECT
    film.film_id,
    film.title,
    inventory_id
FROM film
LEFT JOIN inventory
ON inventory.film_id = film.film_id;
'''
)

In [36]:
left_join_query = pd.DataFrame(cur.fetchall())

In [37]:
left_join_query.shape

(4623, 3)

Because some rows in the filmtable do not have corresponding rows in the inventorytable, the values of the inventory id are NULL.

You can add a WHERE clause to select only films that are not in the inventory as the following query:

In [38]:
cur.execute(
'''
SELECT film.film_id, film.title, inventory_id
FROM film
LEFT JOIN inventory ON inventory.film_id = film.film_id
WHERE inventory.film_id IS NULL;
'''
)

In [39]:
pd.DataFrame(cur.fetchall()).head()

    0                     1     2
0  14        Alice Fantasia  None
1  33           Apollo Teen  None
2  36        Argonauts Town  None
3  38         Ark Ridgemont  None
4  41  Arsenic Independence  None

### With pandas

In [40]:
cur.execute("SELECT * FROM film;")
film_df = pd.DataFrame(cur.fetchall())

cur.execute("SELECT column_name FROM information_schema.columns WHERE table_name='film';")
film_df.columns = [col[0] for col in cur.fetchall()]

In [41]:
film_df.head(1)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...

In [42]:
cur.execute("SELECT * FROM inventory;")
inventory_df = pd.DataFrame(cur.fetchall())
cur.execute("SELECT column_name FROM information_schema.columns WHERE table_name='inventory';")
inventory_df.columns = [col[0] for col in cur.fetchall()]

In [43]:
inventory_df.head()

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 10:09:17
1             2        1         1 2006-02-15 10:09:17
2             3        1         1 2006-02-15 10:09:17
3             4        1         1 2006-02-15 10:09:17
4             5        1         2 2006-02-15 10:09:17

In [44]:
film_df.shape

(1000, 13)

In [45]:
inventory_df.shape

(4581, 4)

In [46]:
film_df.join(inventory_df, on="film_id", lsuffix="_film_df", how="left").shape
# [["film_id", "title", "inventory_id"]]

(1000, 17)

In [47]:
film_df.merge(inventory_df, on="film_id", how="left").shape

(4623, 16)

In [48]:
left_join_query.shape

(4623, 3)

### These are not the same! Any ideas why not?

## Full (Outer) Join

First, we will create two new tables for the demonstration: employees and departments.

Each department has zero or many employees and each employee belongs to zero or one department.

The following INSERT statements add some sample data into the departments and employees tables.

### with psychoPG

In [49]:
cur.execute(
'''
CREATE TABLE
IF NOT EXISTS departments (
 department_id serial PRIMARY KEY,
 department_name VARCHAR (255) NOT NULL
);

CREATE TABLE
IF NOT EXISTS employees (
 employee_id serial PRIMARY KEY,
 employee_name VARCHAR (255),
 department_id INTEGER
);
'''
)

In [50]:
cur.execute(
'''
INSERT INTO departments (department_name)
VALUES
 ('Sales'),
 ('Marketing'),
 ('HR'),
 ('IT'),
 ('Production');
 \
INSERT INTO employees (
 employee_name,
 department_id
)
VALUES \
 ('Bette Nicholson', 1),
 ('Christian Gable', 1),
 ('Joe Swank', 2),
 ('Fred Costner', 3),
 ('Sandra Kilmer', 4),
 ('Julia Mcqueen', NULL); 
 ''')

Next, we query all data from the departments and employees tables (and stick query results in in dataframes, for easy viewing).

In [51]:
cur.execute("SELECT * FROM departments")

departments_df = pd.DataFrame(cur.fetchall())

cur.execute("SELECT column_name FROM information_schema.columns WHERE table_name='departments';")
departments_df.columns = [col[0] for col in cur.fetchall()]

In [52]:
departments_df

   department_id department_name
0              1           Sales
1              2       Marketing
2              3              HR
3              4              IT
4              5      Production

In [53]:
cur.execute("SELECT * FROM employees")

employees_df = pd.DataFrame(cur.fetchall())

cur.execute("SELECT column_name FROM information_schema.columns WHERE table_name='employees';")
employees_df.columns = [col[0] for col in cur.fetchall()]

In [54]:
employees_df

   employee_id    employee_name  department_id
0            1  Bette Nicholson            1.0
1            2  Christian Gable            1.0
2            3        Joe Swank            2.0
3            4     Fred Costner            3.0
4            5    Sandra Kilmer            4.0
5            6    Julia Mcqueen            NaN

Then, we use the FULL OUTER JOIN to query data from both employees and departments tables.

In [56]:
cur.execute(
'''
SELECT
 employee_name,
 department_name
FROM
 employees e
FULL OUTER JOIN departments d ON d.department_id = e.department_id;
'''
)

In [57]:
cur.fetchall()

[('Bette Nicholson', 'Sales'),
 ('Christian Gable', 'Sales'),
 ('Joe Swank', 'Marketing'),
 ('Fred Costner', 'HR'),
 ('Sandra Kilmer', 'IT'),
 ('Julia Mcqueen', None),
 (None, 'Production')]

### with pandas

In [58]:
employees_df.join(departments_df, on="department_id", how="outer", lsuffix="_employees")[["employee_name", "department_name"]]

     employee_name department_name
0  Bette Nicholson       Marketing
1  Christian Gable       Marketing
2        Joe Swank              HR
3     Fred Costner              IT
4    Sandra Kilmer      Production
5    Julia Mcqueen             NaN
5              NaN           Sales

What?! That's very odd. Why do we get different results again?

In [59]:
pd.merge(employees_df, departments_df, on='department_id', how="outer")

   employee_id    employee_name  department_id department_name
0          1.0  Bette Nicholson            1.0           Sales
1          2.0  Christian Gable            1.0           Sales
2          3.0        Joe Swank            2.0       Marketing
3          4.0     Fred Costner            3.0              HR
4          5.0    Sandra Kilmer            4.0              IT
5          6.0    Julia Mcqueen            NaN             NaN
6          NaN              NaN            5.0      Production

Merge is the answer! Join always joins on the left index in pandas

In [60]:
employees_df.merge(departments_df, on="department_id", how="outer")

   employee_id    employee_name  department_id department_name
0          1.0  Bette Nicholson            1.0           Sales
1          2.0  Christian Gable            1.0           Sales
2          3.0        Joe Swank            2.0       Marketing
3          4.0     Fred Costner            3.0              HR
4          5.0    Sandra Kilmer            4.0              IT
5          6.0    Julia Mcqueen            NaN             NaN
6          NaN              NaN            5.0      Production

in pandas, merge and join are both be functions and methods.

## Right Join

This is just the same as a left join but going in the opposite direction.

In [61]:
cur.execute(
'''
SELECT
    film.film_id,
    film.title,
    inventory_id
FROM inventory
RIGHT JOIN film
ON inventory.film_id = film.film_id;
'''
)

In [62]:
right_join_query = pd.DataFrame(cur.fetchall())

In [63]:
right_join_query.shape

(4623, 3)

In [64]:
left_join_query.shape

(4623, 3)

## Cross Join

This is interesting -- produces a Cartesian product. Not in the scope of this review, according to markdown file.

Suppose we have to perform the CROSS JOIN of two tables T1 and T2. For every row from T1 and T2 i.e., a cartesian product, the result set will contain a row that consists of all columns in the T1 table followed by all columns in the T2 table. If T1 has N rows, T2 has M rows, the result set will have N x M rows.

In [65]:
cur.execute(
'''
CREATE TABLE T1 (label CHAR(1) PRIMARY KEY);
CREATE TABLE T2 (score INT PRIMARY KEY);
INSERT INTO T1 (label)
VALUES
 ('A'),
 ('B');
INSERT INTO T2 (score)
VALUES
 (1),
 (2),
 (3);
'''
)

In [66]:
cur.execute(
"SELECT * FROM T1 CROSS JOIN T2;"
)

In [67]:
cross_join = pd.DataFrame(cur.fetchall())
cross_join

   0  1
0  A  1
1  B  1
2  A  2
3  B  2
4  A  3
5  B  3

In [68]:
import itertools

In [69]:
pd.DataFrame(list(itertools.product(["A", "B"], [1,2,3])))

   0  1
0  A  1
1  A  2
2  A  3
3  B  1
4  B  2
5  B  3